Чистая/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Чистая/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Чистая/src/CommonModules/ЦеныСервер/Module.bsl
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	//Добавить общий модуль ЦеныСервер с флажком "Сервер",
	//и создать в нем экспортную функцию ЦенаНаДату(Номенклатура, Дата), 
	//которая получит запросом срез последних на указанную дату 
	//с отбором по номенклатуре и вернет цену.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	ВыгрузкаРезультата = Запрос.Выполнить().Выгрузить();
	Проверка = ВыгрузкаРезультата.Количество();
	Если Проверка <> 0 Тогда
		Цена = ВыгрузкаРезультата[0][0];
	Иначе
		Цена = 0;
	КонецЕсли;
		
	Возврат Цена

	
	

КонецФункции  


Функция СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СкидкиСрезПоследних.Скидка, 0) КАК СкидкаНоменклатура,
	               |	Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |ПОМЕСТИТЬ ВТ_СкидкаНоменклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &НоменклатураНоменклатурнаяГруппа) КАК СкидкиСрезПоследних
	               |		ПО Номенклатура.Ссылка = СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа
	               |ГДЕ
	               |	Номенклатура.Ссылка = &НоменклатураНоменклатурнаяГруппа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СкидкаНоменклатура.СкидкаНоменклатура КАК СкидкаНоменклатура,
	               |	СкидкиСрезПоследних.Скидка КАК СкидкаГруппа
	               |ИЗ
	               |	ВТ_СкидкаНоменклатура КАК ВТ_СкидкаНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Скидки.СрезПоследних(
	               |				&Дата,
	               |				НоменклатураНоменклатурнаяГруппа В
	               |					(ВЫБРАТЬ
	               |						ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |					ИЗ
	               |						ВТ_СкидкаНоменклатура КАК ВТ)) КАК СкидкиСрезПоследних
	               |		ПО ВТ_СкидкаНоменклатура.НоменклатурнаяГруппа = СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ВЫБОР
	               |		КОГДА НоменклатурныеГруппы.Ссылка = &НоменклатураНоменклатурнаяГруппа
	               |			ТОГДА ЕСТЬNULL(СкидкиСрезПоследних.Скидка, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &НоменклатураНоменклатурнаяГруппа) КАК СкидкиСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	               |		ПО СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа = НоменклатурныеГруппы.Ссылка
	               |ГДЕ
	               |	НоменклатурныеГруппы.Ссылка ЕСТЬ НЕ NULL ";
	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("НоменклатураНоменклатурнаяГруппа", НоменклатураНоменклатурнаяГруппа);
	Результат = Запрос.Выполнить(); 
	Если Результат.Пустой() Тогда
		Скидка = 0;
		Возврат Скидка;
	Иначе
		Результат = Результат.Выгрузить();
		Скидка = ?(Результат[0].СкидкаНоменклатура = 0, Результат[0].СкидкаГруппа, Результат[0].СкидкаНоменклатура);
		Возврат Скидка;
	КонецЕсли;
			
	
КонецФункции
